In [1]:
import pandas as pd
import numpy as np
import datetime
from datetime import datetime, timedelta
import seaborn as sns
import matplotlib.pyplot as plt

import time

import warnings
warnings.simplefilter(action = 'ignore', category = FutureWarning)

# imports best practice pandas
import os

import numpy as np
import pandas as pd

#--------------------------------------------------------

In [30]:
df_sales = pd.read_csv('./EDA/DATA/cleaned_sales.csv')
df_prices = pd.read_csv('./EDA/DATA/cleaned_prices.csv')

In [31]:
del(df_sales["Unnamed: 0"])
del(df_prices["Unnamed: 0"])

### Making new colunm so to merge by it

In [32]:
df_prices["id"] = df_prices["item"] + "_" + df_prices["store_code"]

In [33]:
df_prices

,item,store_code,date,sell_price,id
0,ACCESORIES_1_001,BOS_1,2013-07-31,11.753875,ACCESORIES_1_001_BOS_1
1,ACCESORIES_1_001,BOS_1,2013-08-31,10.985800,ACCESORIES_1_001_BOS_1
2,ACCESORIES_1_001,BOS_1,2013-09-30,10.985800,ACCESORIES_1_001_BOS_1
3,ACCESORIES_1_001,BOS_1,2013-10-31,10.985800,ACCESORIES_1_001_BOS_1
4,ACCESORIES_1_001,BOS_1,2013-11-30,10.985800,ACCESORIES_1_001_BOS_1
...,...,...,...,...,...
1536771,SUPERMARKET_3_827,PHI_3,2015-12-31,1.200000,SUPERMARKET_3_827_PHI_3
1536772,SUPERMARKET_3_827,PHI_3,2016-01-31,1.200000,SUPERMARKET_3_827_PHI_3
1536773,SUPERMARKET_3_827,PHI_3,2016-02-29,1.200000,SUPERMARKET_3_827_PHI_3
1536774,SUPERMARKET_3_827,PHI_3,2016-03-31,1.200000,SUPERMARKET_3_827_PHI_3
1536775,SUPERMARKET_3_827,PHI_3,2016-04-30,1.200000,SUPERMARKET_3_827_PHI_3

### deleting useless colunms so to save RAM memory in our calculations

In [34]:
df_prices.drop(["store_code", "item"], axis = 1, inplace = True)

In [36]:
columns = ["id","date", "sell_price"]

In [37]:
df_prices = df_prices[columns]

In [39]:
df_prices

                              id        date  sell_price
0         ACCESORIES_1_001_BOS_1  2013-07-31   11.753875
1         ACCESORIES_1_001_BOS_1  2013-08-31   10.985800
2         ACCESORIES_1_001_BOS_1  2013-09-30   10.985800
3         ACCESORIES_1_001_BOS_1  2013-10-31   10.985800
4         ACCESORIES_1_001_BOS_1  2013-11-30   10.985800
...                          ...         ...         ...
1536771  SUPERMARKET_3_827_PHI_3  2015-12-31    1.200000
1536772  SUPERMARKET_3_827_PHI_3  2016-01-31    1.200000
1536773  SUPERMARKET_3_827_PHI_3  2016-02-29    1.200000
1536774  SUPERMARKET_3_827_PHI_3  2016-03-31    1.200000
1536775  SUPERMARKET_3_827_PHI_3  2016-04-30    1.200000

[1536776 rows x 3 columns]

### transforming values on df["dates] so to merge df_prices and df_sales by it

In [41]:
df_prices["date"] = df_prices["date"].astype(str).apply(lambda x: x[0:7])

In [42]:
df_prices.shape

(1536776, 3)

In [43]:
df_prices

                              id     date  sell_price
0         ACCESORIES_1_001_BOS_1  2013-07   11.753875
1         ACCESORIES_1_001_BOS_1  2013-08   10.985800
2         ACCESORIES_1_001_BOS_1  2013-09   10.985800
3         ACCESORIES_1_001_BOS_1  2013-10   10.985800
4         ACCESORIES_1_001_BOS_1  2013-11   10.985800
...                          ...      ...         ...
1536771  SUPERMARKET_3_827_PHI_3  2015-12    1.200000
1536772  SUPERMARKET_3_827_PHI_3  2016-01    1.200000
1536773  SUPERMARKET_3_827_PHI_3  2016-02    1.200000
1536774  SUPERMARKET_3_827_PHI_3  2016-03    1.200000
1536775  SUPERMARKET_3_827_PHI_3  2016-04    1.200000

[1536776 rows x 3 columns]

In [44]:
df_sales

                              id     date  sales
0         ACCESORIES_1_001_BOS_1  2011-01      0
1         ACCESORIES_1_001_BOS_1  2011-02      0
2         ACCESORIES_1_001_BOS_1  2011-03      0
3         ACCESORIES_1_001_BOS_1  2011-04      0
4         ACCESORIES_1_001_BOS_1  2011-05      0
...                          ...      ...    ...
1951355  SUPERMARKET_3_827_PHI_3  2015-12     41
1951356  SUPERMARKET_3_827_PHI_3  2016-01     49
1951357  SUPERMARKET_3_827_PHI_3  2016-02     46
1951358  SUPERMARKET_3_827_PHI_3  2016-03     68
1951359  SUPERMARKET_3_827_PHI_3  2016-04     15

[1951360 rows x 3 columns]

In [45]:
df_market = pd.merge(df_sales,df_prices, on=["id", "date"], how="left")

In [46]:
df_market["sell_price"].isnull().sum()

np.int64(414584)

### deleting nulls on sell_price column as we consider if there isn´t price it is because the item hadn´t arrive yet to the store

In [47]:
df_market.dropna(subset=(["sell_price"]), inplace = True)

In [48]:
df_market

                              id     date  sales  sell_price
30        ACCESORIES_1_001_BOS_1  2013-07     10   11.753875
31        ACCESORIES_1_001_BOS_1  2013-08      3   10.985800
32        ACCESORIES_1_001_BOS_1  2013-09      4   10.985800
33        ACCESORIES_1_001_BOS_1  2013-10      4   10.985800
34        ACCESORIES_1_001_BOS_1  2013-11     10   10.985800
...                          ...      ...    ...         ...
1951355  SUPERMARKET_3_827_PHI_3  2015-12     41    1.200000
1951356  SUPERMARKET_3_827_PHI_3  2016-01     49    1.200000
1951357  SUPERMARKET_3_827_PHI_3  2016-02     46    1.200000
1951358  SUPERMARKET_3_827_PHI_3  2016-03     68    1.200000
1951359  SUPERMARKET_3_827_PHI_3  2016-04     15    1.200000

[1536776 rows x 4 columns]

###  Making new columns "Income"

In [49]:
df_market["income"] = df_market["sales"] * df_market["sell_price"]

In [50]:
df_market.sample(5)

                                id     date  sales  sell_price    income
1072916    SUPERMARKET_1_066_NYC_2  2012-09     52      1.6320   84.8640
635089   HOME_&_GARDEN_1_437_NYC_1  2012-06      0      4.1000    0.0000
135474      ACCESORIES_1_218_NYC_4  2015-03     14     14.0714  196.9996
930208   HOME_&_GARDEN_2_358_NYC_2  2013-09      2      6.2125   12.4250
240816      ACCESORIES_1_385_BOS_3  2015-01      0     11.9434    0.0000

### Loading original item_sales_df for making dicts to map new columns

In [53]:
original_sales = pd.read_csv("./data/item_sales.csv")

In [61]:
store_map =original_sales.groupby("store_code")["store"].first()

In [63]:
store_dict=store_map.to_dict()

In [64]:
store_dict

{'BOS_1': 'South_End',
 'BOS_2': 'Roxbury',
 'BOS_3': 'Back_Bay',
 'NYC_1': 'Greenwich_Village',
 'NYC_2': 'Harlem',
 'NYC_3': 'Tribeca',
 'NYC_4': 'Brooklyn',
 'PHI_1': 'Midtown_Village',
 'PHI_2': 'Yorktown',
 'PHI_3': 'Queen_Village'}

### adding old columns to our df_market so to use them in visualizations or any other calculates afterwards

<!-- ### now we agregate old columns so to use them in other calculations or visualizations  -->

In [65]:
df_market["store_code"] = df_market["id"].apply(lambda x: x[-5:])

In [66]:
df_market["category"] = df_market["id"].apply(lambda x: x[:-12])

In [67]:
df_market["region"] = df_market["store_code"].apply(lambda x: x[0:3])

In [70]:
df_market["item"] = df_market["id"].apply(lambda x: x[0:-6])

In [68]:
df_market["store"] = df_market["store_code"].apply(lambda x: store_dict[x])

In [72]:
columns = ["id", "item","category","region","store_code", "store","date", "sales", "sell_price", "income" ]

In [73]:
df_market = df_market[columns]

In [75]:
df_market.reset_index(inplace=True, drop=True)

In [76]:
df_market.sample(2)

,id,item,category,region,store_code,store,date,sales,sell_price,income
435912,HOME_&_GARDEN_1_309_NYC_1,HOME_&_GARDEN_1_309,HOME_&_GARDEN,NYC,NYC_1,Greenwich_Village,2013-08,27,8.7125,235.2375
1300086,SUPERMARKET_3_351_NYC_2,SUPERMARKET_3_351,SUPERMARKET,NYC,NYC_2,Harlem,2012-12,227,1.2000,272.4000

In [77]:
file_name = "df_market_by_months.csv"
df_market.to_csv(file_name)